Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  MODEL HANDLE – FINAL (2025)
 *  ✔ ALL MODES WORKING
 *  ✔ TIMER MODE FIXED
 *  ✔ EEPROM SAFE (RESET PROOF)
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"
#include "eeprom_i2c.h"
#include "main.h"          // BUZZER: LED5
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
extern I2C_HandleTypeDef hi2c2;
/***************************************************************
 *  EXTERNAL MODULE VARIABLES
 ***************************************************************/
extern ADC_Data adcData;
extern RTC_Time_t time;
extern float g_currentA;
extern float g_voltageV;

/***************************************************************
 * ================= TIMER EEPROM SAFE BLOCK ===================
 ***************************************************************/
#define TIMER_EE_SIGNATURE  0x544D   /* 'TM' */
#define TIMER_EE_VERSION    1
#define EE_ADDR_TIMER_BLOCK 0x7000    // last EEPROM page (safe)


typedef struct {
    uint16_t signature;
    uint8_t  version;
    uint8_t  reserved;
    TimerSlot slots[5];
    uint16_t crc;
} TimerEEPROMBlock;

/***************************************************************
 * CRC16 (EEPROM SAFETY)
 ***************************************************************/
static uint16_t Timer_CRC16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFF;
    while (len--) {
        crc ^= *data++;
        for (uint8_t i = 0; i < 8; i++)
            crc = (crc & 1) ? (crc >> 1) ^ 0xA001 : (crc >> 1);
    }
    return crc;
}

/***************************************************************
 * TIMER SLOTS (5)
 ***************************************************************/
TimerSlot timerSlots[5];

/***************************************************************
 * MODE FLAGS
 ***************************************************************/
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/***************************************************************
 * MOTOR STATUS
 ***************************************************************/
volatile uint8_t motorStatus = 0;

/***************************************************************
 * PROTECTION FLAGS
 ***************************************************************/
volatile bool senseDryRun         = false;
volatile bool senseOverLoad       = false;
volatile bool senseUnderLoad      = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
volatile bool manualOverride      = false;

/* Legacy externs */
volatile uint16_t auto_retry_counter = 0;
volatile bool     countdownMode      = false;
volatile uint32_t countdownDuration  = 0;

/***************************************************************
 * TWIST SETTINGS
 ***************************************************************/
TwistSettings twistSettings;
/***************************************************************
 * ===================== DEVICE SETTINGS =======================
 ***************************************************************/
typedef struct {
    bool    manual_on;
    bool    semi_on;
    bool    timer_on;
    bool    countdown_on;
    bool    twist_on;
    bool    auto_on;
    bool    motor_on;
    uint8_t power_restore_mode; /* 0=YES, 1=NO, 2=LAST */
} ModeState;

static ModeState modeState;
#define EE_ADDR_COUNTDOWN_BLOCK 0x0040
#define EE_ADDR_MODE_BLOCK     0x0080
#define EE_ADDR_AUTO_BLOCK     0x00C0
#define CD_SIGNATURE 0xCD55
static bool autoResumeBoot = false;
void ModelHandle_CheckDryRun(void);
void ModelHandle_CheckLoadFault(void);
static uint8_t AUTO_CRC(const uint8_t* d, uint16_t l);

typedef struct{
    uint16_t sig;
    uint32_t remaining;
    uint8_t  active;
    uint16_t crc;
} CountdownBlock;

/* Power Restore runtime copy */
static uint8_t powerRestoreMode = 0;

/* System defaults */
SystemSettings sys = {
    .gap_time_s  = 0,
    .retry_count = 0,
    .uv_limit    = 190,
    .ov_limit    = 270,
    .overload    = 0.0f,
    .underload   = 0.0f,
    .maxrun_min  = 300
};
/***************************************************************
 * ========== INTERNAL FORWARD DECLARATIONS (FIX) ==============
 ***************************************************************/

/* Motor helpers */
static inline void start_motor(void);
static inline void stop_motor(void);

/* Mode helpers */
static inline void clear_all_modes(void);
static inline bool isAnyModeActive(void);
static void SaveAutoRuntime(void);
/* Dry-run */
void ModelHandle_SoftDryRunHandler(void);

/* Timer helpers */
static bool     timer_any_active_slot(void);
static uint16_t get_active_timer_gap_minutes(void);
static uint8_t  get_today_mask(void);
static bool     slot_is_active_now(const TimerSlot *t);

static void SaveCountdown(void);
/* FSM ticks */
static void auto_tick(void);
static void countdown_tick(void);
static void twist_tick(void);
static void twist_time_logic(void);
static void protections_tick(void);
static void leds_from_model(void);
typedef enum {
    MOTOR_OWNER_NONE = 0,
    MOTOR_OWNER_MANUAL,
    MOTOR_OWNER_SEMIAUTO,
    MOTOR_OWNER_TIMER,
    MOTOR_OWNER_COUNTDOWN,
    MOTOR_OWNER_TWIST,
    MOTOR_OWNER_AUTO
} MotorOwner;

static volatile MotorOwner motorOwner = MOTOR_OWNER_NONE;
#ifndef EEPROM_PAGE_SIZE
#define EEPROM_PAGE_SIZE 16
#endif

#ifndef EEPROM_I2C_ADDR
#define EEPROM_I2C_ADDR (0x50 << 1)
#endif

#ifndef EEPROM_ADDR_SIZE
#define EEPROM_ADDR_SIZE I2C_MEMADD_SIZE_8BIT
#endif

void EEPROM_WriteBlockSafe(uint16_t addr, uint8_t *data, uint16_t len)
{
    while (len)
    {
        uint16_t page_space = EEPROM_PAGE_SIZE - (addr % EEPROM_PAGE_SIZE);
        uint16_t chunk = (len < page_space) ? len : page_space;

        HAL_I2C_Mem_Write(&hi2c2, EEPROM_I2C_ADDR, addr,
                          EEPROM_ADDR_SIZE, data, chunk, 1000);
        HAL_Delay(6);

        addr += chunk;
        data += chunk;
        len  -= chunk;
    }
}

typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint8_t  gap;
    uint8_t  retry;
    uint16_t uv;
    uint16_t ov;
    uint8_t  maxrun;
    uint16_t over10;
    uint16_t under10;
    uint8_t  crc;
} SystemEEPROMBlock;

#define EE_ADDR_SYS_BLOCK      0x0000
#define SYS_SIG 0x5A5A

