Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}

/* Factory reset */
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;

    ModelHandle_SaveSettingsToEEPROM();
}

/* Timer helper */
void ModelHandle_StartTimerNearestSlot(void)
{
    clear_all_modes();
    timerActive = true;
    motorOwner = MOTOR_OWNER_TIMER;
    ModelHandle_ProcessTimerSlots();
}
static inline void Buzzer_SetPin(bool on)
{
    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static uint32_t buzzerAlertUntil = 0;

static void Buzzer_TriggerAlert(void)
{
    buzzerAlertUntil = HAL_GetTick() + 30000UL;
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    bool motorOn = Motor_GetStatus();
    bool alert   = (now < buzzerAlertUntil);

    static bool buzzerState = false;
    bool newState = false;

    if (alert)
    {
        newState = ((now % 600UL) < 200UL);
    }
    else if (motorOn)
    {
        newState = ((now % 800UL) < 150UL);
    }

    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}
/* Reset key (SW1) */
void reset(void)
{
    /* If any protection fault is active, do not attempt reset run */
    if (senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached)
    {
        stop_motor();
        return;
    }

    /* Treat reset as a special manual test — no other modes */
    clear_all_modes();
    manualOverride = true;

    /* 1) Start motor and run up to 5s to check for water (dry-run sensor) */
    start_motor();

    uint32_t start = HAL_GetTick();
    senseDryRun = true;  // assume dry until we see water

    while ((HAL_GetTick() - start) < 5000UL)
    {
        /* Update dry-run status based on sensor voltage */
        ModelHandle_CheckDryRun();

        /* If water is detected (dry-run cleared), break early */
        if (!senseDryRun)
            break;

        HAL_Delay(100);
    }

    /* After 5s: if still dry → stop motor and exit */
    if (senseDryRun)
    {
        stop_motor();
        manualOverride = false;
        Buzzer_TriggerAlert();      // <<< BUZZER: tank empty / dry run
        return;
    }

    /* 2) Water available → keep motor ON until tank is full or fault */
    while (!isTankFull())
    {
    	stop_motor();
        ModelHandle_CheckLoadFault();
        if (senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached)
        {

            manualOverride = false;
            Buzzer_TriggerAlert();  // <<< BUZZER: load/volt fault
            return;
        }

        ModelHandle_CheckDryRun();
        if (senseDryRun)
        {
            stop_motor();
            manualOverride = false;
            Buzzer_TriggerAlert();  // <<< BUZZER: dry run while reset
            return;
        }

        HAL_Delay(100);
    }

    /* Tank full → stop motor */
    stop_motor();
    manualOverride = false;
    Buzzer_TriggerAlert();          // <<< BUZZER: tank full
}


static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}

/***************************************************************
 * ================= MOTOR CONTROL =============================
 ***************************************************************/
static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
}
/*********************** MOTOR CORE (SAFE) ************************/

/* Physical relay truth (prevents desync) */
static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}


/* Power-on delay */
static bool Motor_StartAllowed(void)
{
    return (HAL_GetTick() - powerOnMs) >= 7000UL;   // 7s safety delay
}

/* Unified motor apply — self healing */
static inline void motor_apply(bool on)
{
    bool relayNow = Motor_IsRelayOn();

    if (on)
    {
        if (!Motor_StartAllowed())
            return;

        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }

        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);

        motorStatus = 0;
        motorOwner  = MOTOR_OWNER_NONE;
    }

    UART_SendStatusPacket();
}

/* Absolute emergency OFF */
static void motor_force_off(void)
{
    Relay_Set(1, false);
    motorStatus = 0;
    motorOwner  = MOTOR_OWNER_NONE;
    UART_SendStatusPacket();
}

/* External motor status */
bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}

/* Safe start with ownership */
static inline void start_motor(void)
{
    if (motorOwner == MOTOR_OWNER_NONE)
    {
        if      (autoActive)       motorOwner = MOTOR_OWNER_AUTO;
        else if (timerActive)      motorOwner = MOTOR_OWNER_TIMER;
        else if (twistActive)      motorOwner = MOTOR_OWNER_TWIST;
        else if (countdownActive)  motorOwner = MOTOR_OWNER_COUNTDOWN;
        else if (semiAutoActive)   motorOwner = MOTOR_OWNER_SEMIAUTO;
        else                       motorOwner = MOTOR_OWNER_MANUAL;
    }

    motor_apply(true);
}

/* Safe stop — always hard OFF */
static inline void stop_motor(void)
{
    motor_apply(false);
}

/***************************************************************
 * ================= MAX RUN PROTECTION ========================
 ***************************************************************/
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;

