Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (countdownActive)
        return;

    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
        Buzzer_TriggerAlert();
    }
}

/***************************************************************
 * ================= DRY RUN SENSOR ============================
 ***************************************************************/
void ModelHandle_CheckDryRun(void)
{
    /* Manual, Semi-Auto, Countdown ignore dry-run feature */
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[0];

    if (v < 0.01f)
        senseDryRun = true;   /* DRY */
    else
        senseDryRun = false;  /* WATER OK */
}


/***************************************************************
 * ================= SOFT DRY RUN FSM ==========================
 ***************************************************************/
#define DRY_PROBE_ON_MS   5000UL
#define DRY_CONFIRM_MS    1500UL

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;
static uint32_t dryOffGapMs     = 10000UL;

typedef enum {
    DRY_IDLE = 0,
    DRY_PROBE,
    DRY_NORMAL
} DryFSMState;

static DryFSMState dryState      = DRY_IDLE;
static bool        dryConfirming = false;

static inline bool isAnyModeActive(void)
{
    return (manualActive || semiAutoActive || countdownActive ||
            twistActive || timerActive || autoActive);
}

void ModelHandle_SoftDryRunHandler(void)
{
	if (autoActive) return;    // <<< AUTO MODE CONTROLS MOTOR

	if(motorOwner != MOTOR_OWNER_NONE &&
	   motorOwner != MOTOR_OWNER_AUTO &&
	   motorOwner != MOTOR_OWNER_TIMER)
	    return;

    uint32_t now = now_ms();

    if (timerActive)
        return;   // timer has its own dry-run logic

    uint16_t gap_s = sys.gap_time_s;
    if (timerActive)
    {
        uint16_t slotGap = get_active_timer_gap_minutes();
        if (slotGap > 0) gap_s = slotGap * 60U;
    }

    ModelHandle_CheckDryRun();
    if (gap_s == 0) return;

    dryOffGapMs = (uint32_t)gap_s * 1000UL;

    if (manualActive || semiAutoActive || countdownActive)
    {
        dryState = DRY_IDLE;
        dryConfirming = false;
        return;
    }

    if (!isAnyModeActive())
    {
        stop_motor();
        dryState = DRY_IDLE;
        return;
    }

    switch (dryState)
    {
        case DRY_IDLE:
            if (!senseDryRun)
            {
                start_motor();
                dryState = DRY_NORMAL;
            }
            else if (now >= dryDeadline)
            {
                start_motor();
                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
            }
            break;

        case DRY_PROBE:
            if (!senseDryRun)
            {
                dryState = DRY_NORMAL;
            }
            else if (now >= dryDeadline)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryDeadline = now + dryOffGapMs;
                Buzzer_TriggerAlert();
            }
            break;

        case DRY_NORMAL:
            if (senseDryRun)
            {
                if (!dryConfirming)
                {
                    dryConfirming = true;
                    dryConfirmStart = now;
                }
                else if ((now - dryConfirmStart) >= DRY_CONFIRM_MS)
                {
                    stop_motor();
                    dryState = DRY_IDLE;
                    dryConfirming = false;
                    dryDeadline = now + dryOffGapMs;
                    Buzzer_TriggerAlert();
                }
            }
            else
            {
                dryConfirming = false;
            }
            break;
    }
}

/***************************************************************
 * ================= LOAD / VOLTAGE FSM ========================
 ***************************************************************/
#define LOAD_FAULT_CONFIRM_MS 3000UL
#define LOAD_RETRY_RUN_MS     3000UL
#define LOAD_LOCK_DEFAULT_MS (20UL * 60UL * 1000UL)
#define TIMER_RETRY_30MIN_MS (30UL * 60UL * 1000UL)

typedef enum {
    LOAD_NORMAL = 0,
    LOAD_FAULT_WAIT,
    LOAD_FAULT_LOCK,
    LOAD_RETRY_RUN
} LoadFaultState;

static LoadFaultState loadState = LOAD_NORMAL;
static uint32_t loadTimer = 0;
static uint8_t  loadRetryCount = 0;

static inline uint32_t get_load_lock_duration_ms(void)
{
    if (sys.retry_count == 0)
        return LOAD_LOCK_DEFAULT_MS;
    return (uint32_t)sys.retry_count * 60000UL;
}

void ModelHandle_CheckLoadFault(void)
{
	if(motorOwner != MOTOR_OWNER_NONE &&
	   motorOwner != MOTOR_OWNER_AUTO &&
	   motorOwner != MOTOR_OWNER_TIMER)
	    return;

    float I = g_currentA;
    float V = g_voltageV;

    bool overload  = (sys.overload > 0.1f) && (I > sys.overload);
    bool underload = (sys.underload > 0.001f) && (I < sys.underload);
    bool voltFault = ((sys.uv_limit && V < sys.uv_limit) ||
                      (sys.ov_limit && V > sys.ov_limit));

    senseOverLoad      = overload;
    senseUnderLoad     = underload;
    senseOverUnderVolt = voltFault;

    bool fault = overload || underload || voltFault;
    uint32_t now = HAL_GetTick();

    uint32_t lockMs = (timerActive && timer_any_active_slot())
                        ? TIMER_RETRY_30MIN_MS
                        : get_load_lock_duration_ms();

    switch (loadState)
    {
        case LOAD_NORMAL:
            loadRetryCount = 0;
            if (fault && Motor_GetStatus())
            {
                loadState = LOAD_FAULT_WAIT;
                loadTimer = now;
            }
            break;

        case LOAD_FAULT_WAIT:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= LOAD_FAULT_CONFIRM_MS)
            {
                stop_motor();
                loadState = LOAD_FAULT_LOCK;
                loadTimer = now;
                Buzzer_TriggerAlert();
            }
            break;

