Amiya200/stm32_water_tank/Core/Src/model_handle.c
        case LOAD_FAULT_LOCK:
            if (!fault &&
                (autoActive || (timerActive && timer_any_active_slot())))
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= lockMs && loadRetryCount < 1)
            {
                loadRetryCount++;
                start_motor();
                loadState = LOAD_RETRY_RUN;
                loadTimer = now;
            }
            break;

        case LOAD_RETRY_RUN:
            if ((now - loadTimer) >= LOAD_RETRY_RUN_MS)
            {
                if (fault)
                {
                    stop_motor();
                    loadState = LOAD_FAULT_LOCK;
                    loadTimer = now;
                    Buzzer_TriggerAlert();
                }
                else
                {
                    loadState = LOAD_NORMAL;
                    loadRetryCount = 0;
                }
            }
            break;
    }
}
/***************************************************************
 * ======================= TIMER MODE ==========================
 * DS1307 DOW: 1 = Mon ... 7 = Sun
 * dayMask: bit0 = Mon ... bit6 = Sun
 ***************************************************************/
static uint8_t get_today_mask(void)
{
    uint8_t d = time.dow;
    if (d < 1 || d > 7) d = 1;
    return (1U << (d - 1));
}

static bool slot_is_active_now(const TimerSlot *t)
{
    if (!t->enabled) return false;
    if (!(t->dayMask & get_today_mask())) return false;

    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;

    return (on < off) ? (now >= on && now < off)
                      : (now >= on || now < off);
}

static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}

static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;

    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;

        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;

        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);

        if (active)
            return t->gapMinutes;
    }
    return 0;
}
static uint32_t timer_get_gap_ms(void)
{
    uint16_t gapMin = get_active_timer_gap_minutes();

    if (gapMin == 0)
        return 0;

    return (uint32_t)gapMin * 60UL * 1000UL;
}

/***************************************************************
 * TIMER PROCESS (CALLED EVERY LOOP)
 ***************************************************************/
typedef enum {
    TIMER_STATE_ON,
    TIMER_STATE_OFF,
    TIMER_STATE_WATER_CONTINUOUS
} TimerState;
static TimerState timerState = TIMER_STATE_ON;
static uint32_t   timerStateDeadline = 0;


void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive)
        return;

    /* If slot not active → motor OFF */
    if (!timer_any_active_slot())
    {
        stop_motor();
        timerState = TIMER_STATE_ON;
        return;
    }

    if (isTankFull())
       {
           stop_motor();          // motor forced OFF
           return;                // keep slot active but motor clamped
       }
    /* Read dry-run sensor */
    ModelHandle_CheckDryRun();

    uint32_t now = HAL_GetTick();
    uint32_t gapMs = timer_get_gap_ms();   // gapMinutes → ms

    if (gapMs == 0)
    {
        /* No gap configured → normal timer behavior */
        start_motor();
        return;
    }

    if (autoActive && isTankFull())
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    /* ================= WATER AVAILABLE ================= */
    if (senseDryRun == true)
    {
        timerState = TIMER_STATE_WATER_CONTINUOUS;
        start_motor();
        return;
    }

    /* ================= NO WATER (CYCLIC TEST) ================= */
    switch (timerState)
    {
        case TIMER_STATE_ON:
            start_motor();

            if (timerStateDeadline == 0)
                timerStateDeadline = now + gapMs;

            if (now >= timerStateDeadline)
            {
                stop_motor();
                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;
            }
            break;

        case TIMER_STATE_OFF:
            stop_motor();

            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = now + gapMs;
            }
            break;

        case TIMER_STATE_WATER_CONTINUOUS:
            /* Should never stay here if no water */
            timerState = TIMER_STATE_ON;
            timerStateDeadline = now + gapMs;
            break;
    }
}

/***************************************************************
 * START / STOP TIMER MODE
 ***************************************************************/
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;
    ModelHandle_SaveTimerToEEPROM();
    ModelHandle_ProcessTimerSlots();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

/***************************************************************
 * AUTO TIMER ACTIVATION
 ***************************************************************/
void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}

/***************************************************************
 * ===================== SEMI AUTO MODE ========================
 ***************************************************************/
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner = MOTOR_OWNER_SEMIAUTO;
    senseDryRun = false;
    if (!isTankFull())
        start_motor();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

/***************************************************************
 * ======================== AUTO MODE ==========================
 ***************************************************************/
static uint16_t auto_gap_s       = 10;
static uint16_t auto_maxrun_min  = 12;
static uint8_t  auto_retry_limit = 5;
static uint8_t  auto_retry_count = 0;

