Amiya200/stm32_water_tank/Core/Src/model_handle.c
typedef enum {
    AUTO_IDLE = 0,
    AUTO_ON_WAIT,
    AUTO_DRY_CHECK,
    AUTO_OFF_WAIT
} AutoState;

static AutoState autoState    = AUTO_IDLE;
static uint32_t  autoDeadline = 0;
#define EE_ADDR_AUTO_RUNTIME  0x0340
#define AUTO_SIG 0xA055

typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint8_t  active;
    uint8_t  state;
    uint8_t  retryCount;
    uint32_t remaining_ms;
    uint8_t  crc;
} AutoRuntimeBlock;
void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();

    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;

    ModelHandle_SaveModeState();
    start_motor();
    autoDeadline = now_ms() + gap_s * 1000UL;
}

void ModelHandle_StopAuto(void)
{
	stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME, (uint8_t[]){0}, sizeof(AutoRuntimeBlock));
    ModelHandle_SaveModeState();

}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));

    AutoRuntimeBlock b;
    EEPROM_ReadBuffer(EE_ADDR_AUTO_RUNTIME,(uint8_t*)&b,sizeof(b));

    if(b.sig != AUTO_SIG) return;
    if(AUTO_CRC((uint8_t*)&b,sizeof(b)-1) != b.crc) return;
    if(!b.active) return;

    autoActive       = true;
    autoState        = (AutoState)b.state;
    auto_retry_count = b.retryCount;
    autoDeadline     = now_ms() + b.remaining_ms;
    autoResumeBoot   = true;     // <<< MARK BOOT RESUME


    start_motor();   // resumes from exact phase
}
static void auto_tick(void)
{


    if (!autoActive) return;

    uint32_t now = now_ms();

    /* ===== AUTO runtime safe-save every 5 sec ===== */
    static uint32_t lastSave = 0;
    if(now - lastSave >= 5000UL)
    {
        lastSave = now;
        SaveAutoRuntime();
    }

    if (isTankFull())
    {
        ModelHandle_StopAuto();
        stop_motor();
        EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME, (uint8_t[]){0}, sizeof(AutoRuntimeBlock));
        Buzzer_TriggerAlert();
        return;
    }

    if(autoResumeBoot)
    	{
    	    autoResumeBoot = false;

    	    // Resume correct phase
    	    if(autoState == AUTO_ON_WAIT || autoState == AUTO_DRY_CHECK)
    	        start_motor();
    	    else
    	        stop_motor();

    	    return;
    	}
    switch (autoState)
    {
    case AUTO_ON_WAIT:
        start_motor();
        motorStatus = 1;
        if (now >= autoDeadline)
            autoState = AUTO_DRY_CHECK;
        break;


        case AUTO_DRY_CHECK:
            ModelHandle_CheckDryRun();
            if (!senseDryRun)
            {
                stop_motor();
                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
                Buzzer_TriggerAlert();
            }
            else
            {
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;

        case AUTO_OFF_WAIT:
            if (now >= autoDeadline)
            {
                auto_retry_count++;
                auto_retry_counter = auto_retry_count;

                if (auto_retry_limit &&
                    auto_retry_count > auto_retry_limit)
                {
                    ModelHandle_StopAuto();
                    return;
                }

                start_motor();
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;

        default:
            break;
    }
}

/***************************************************************
 * ====================== COUNTDOWN MODE =======================
 ***************************************************************/
static uint32_t cd_deadline = 0;

void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();
    if (seconds == 0) return;

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;

    ModelHandle_SaveModeState();
    start_motor();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();                 // clear EEPROM
    stop_motor();
    ModelHandle_SaveModeState();
}

static void countdown_tick(void)
{
    if (!countdownActive) return;

    uint32_t now = now_ms();

    /* Tank full ends countdown */
    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }

    /* Deadline expired */
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }

    /* Update remaining time */
    countdownDuration = (cd_deadline - now) / 1000UL;

    /* ===== EEPROM POWER CUT SAFE SAVE (every 5 seconds) ===== */
    static uint32_t lastSave = 0;
    if ((now - lastSave) >= 5000UL)
    {
        lastSave = now;
        SaveCountdown();     // stores remaining seconds safely
    }
}

static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}
static void SaveCountdown(void)
{
    CountdownBlock b;
    b.sig = CD_SIGNATURE;
    b.remaining = countdownDuration;
    b.active = countdownActive;
    b.crc = CD_CRC((uint8_t*)&b,sizeof(b)-2);

    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
}

void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));

    if(b.sig!=CD_SIGNATURE) return;
    if(CD_CRC((uint8_t*)&b,sizeof(b)-2)!=b.crc) return;

    if(b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;

