Amiya200/stm32_water_tank/Core/Src/model_handle.c
        cd_deadline = now_ms() + b.remaining * 1000UL;   // <<< FIX
        start_motor();
    }
}

/***************************************************************
 * ========================= TWIST MODE ========================
 ***************************************************************/
static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;

    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;

    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed) return;

    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;
        twist_on_phase = true;
        twist_deadline = now_ms() +
                         twistSettings.onDurationSeconds * 1000UL;
        start_motor();
    }

    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}

static void twist_tick(void)
{
    if (!twistActive) return;

    if (isTankFull())
    {
        ModelHandle_StopTwist();
        Buzzer_TriggerAlert();
        return;
    }

    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }

    if (twist_on_phase) start_motor();
    else stop_motor();
}
/***************************************************************
 * ======================= PROTECTIONS =========================
 ***************************************************************/
static void protections_tick(void)
{
    if (senseMaxRunReached)
        stop_motor();
}

/***************************************************************
 * =========================== LEDS =============================
 ***************************************************************/
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    bool motorOn = Motor_GetStatus();

    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    if (!senseDryRun)
    {
        if (motorOn)
            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);
        else
            LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }

    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    LED_ApplyIntents();
}

/***************************************************************
 * ========================== MASTER FSM ========================
 ***************************************************************/
void ModelHandle_Process(void)
{
    /* =========================================================
     * ALWAYS FIRST – background protections & schedulers
     * ========================================================= */
    ModelHandle_CheckLoadFault();
    protections_tick();
    twist_time_logic();
    check_max_run();
    ModelHandle_SoftDryRunHandler();

    /* =========================================================
     * HARD STOP ONLY – Max run protection (ALL MODES)
     * ========================================================= */
    if (senseMaxRunReached)
    {
        stop_motor();
        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * MANUAL MODE – ABSOLUTE OVERRIDE
     * ========================================================= */
    if (manualActive)
    {
        /* Manual means: user is king */
        if (!Motor_GetStatus())
            start_motor();

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * AUTO MODE
     * ========================================================= */
    if (autoActive)
    {
        auto_tick();
        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * SEMI-AUTO MODE
     * ========================================================= */
    if (semiAutoActive)
    {
        if (!isTankFull())
        {
            if (!Motor_GetStatus())
                start_motor();
        }
        else
        {
            semiAutoActive = false;
            clear_all_modes();
            motor_force_off();
            ModelHandle_SaveModeState();
            Buzzer_TriggerAlert();
        }

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * TIMER MODE
     * ========================================================= */
    if (timerActive)
    {
        ModelHandle_ProcessTimerSlots();
        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * COUNTDOWN MODE
     * ========================================================= */
    if (countdownActive)
    {
        countdown_tick();

        if (!Motor_GetStatus())
            start_motor();

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * TWIST MODE
     * ========================================================= */
    if (twistActive)
    {
        twist_tick();
        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* =========================================================
     * IDLE – nothing active
     * ========================================================= */
    stop_motor();
    leds_from_model();
    Buzzer_Update();
}

/***************************************************************
 * =========================== RESET ============================
 ***************************************************************/
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();

    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;

    countdownDuration = 0;

    UART_SendStatusPacket();
}

/***************************************************************
 * ===================== AUTO SETTINGS API ======================
 ***************************************************************/
/***************************************************************
 * ================= USER SETTINGS APPLY ======================
 ***************************************************************/
void ModelHandle_SetUserSettings(uint16_t gap_s,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    sys.gap_time_s  = gap_s;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;

